Wittiii/Esp32cam/src/dfr1154_cam_controller.cpp
void publishStatus(bool forceConfig) {
  g_statusPublishPending = true;
  g_configPublishPending = g_configPublishPending || forceConfig;
}

void flushStatus() {
  static String previousConfig;
  if (!g_statusPublishPending || !g_mqttClient.connected()) return;
  const bool forceConfig = g_configPublishPending;
  g_statusPublishPending = false;
  g_configPublishPending = false;

  publishSimple("status/online", "true");
  publishSimple("status/state", streamState());
  publishSimple("status/error", g_lastError);
  publishSimple("status/ip", WiFi.status() == WL_CONNECTED ? WiFi.localIP().toString() : "-");
  publishSimple("status/rtsp_url", rtspUrl());
  publishSimple("status/mdns", String(dfrcfg::kMdnsHostname) + ".local");
  publishSimple("status/last_status", g_lastStatus);
  publishSimple("status/clients", String(directStreamingSessionCount()));
  publishSimple("status/direct_sessions", String(directSessionCount()));
  publishSimple("status/direct_streaming_clients", String(directStreamingSessionCount()));
  publishSimple("status/frame_fps", String(g_lastMeasuredFps, 1));
  publishSimple("status/configured_fps", String(g_streamFps));
  publishSimple("status/mqtt_connected", "true");
  publishSimple("status/wifi_rssi", String(WiFi.RSSI()));
  publishSimple("status/uptime_seconds", String(millis() / 1000UL));
  publishSimple("status/free_heap_bytes", String(ESP.getFreeHeap()));
  publishSimple("status/min_free_heap_bytes", String(ESP.getMinFreeHeap()));
  publishSimple("status/reset_reason", resetReasonName(g_bootResetReason));
  publishSimple("status/firmware_version", dfrcfg::kFirmwareVersion);
  publishSimple("status/wifi_reconnect_count", String(g_wifiReconnectCount));
  publishSimple("status/mqtt_reconnect_count", String(g_mqttReconnectCount));
  publishSimple("status/camera_recovery_count", String(g_cameraRecoveryCount));
  publishSimple("status/mqtt_publish_failures", String(g_mqttPublishFailures));
  publishSimple("status/mqtt_command_drops", String(g_mqttCommandDrops));
  publishSimple("status/ambient_lux", isfinite(g_ambientLux) ? String(g_ambientLux, 2) : "-");
  publishSimple("status/ir_mode", irModeName());
  publishSimple("status/ir_enabled", g_irEnabled ? "true" : "false");
  publishSimple("status/light_sensor", g_lightReady ? "ready" : "unavailable");
  publishExternalSensors();
  publishSimple("status/capture_request/state", dfrcapture::state());
  publishSimple("status/capture_request/enabled", dfrcapture::enabled() ? "true" : "false");
  publishSimple("status/capture_request/interval_seconds", String(dfrcapture::intervalSeconds()));
  publishSimple("status/command/id", g_lastCommandId);
  publishSimple("status/command/name", g_lastCommandName);
  publishSimple("status/command/result", g_lastCommandResult);
  publishSimple("status/command/message", g_lastCommandMessage);
  publishSimple("status/command/at_ms", String(g_lastCommandAtMs));

  const String config = buildConfigJson();
  if (forceConfig || config != previousConfig) {
    if (publishSimple("status/config", config)) previousConfig = config;
  }
}

bool saveControllerSettings() {
  if (!g_preferencesReady) {
    setError("settings storage unavailable");
    return false;
  }
  // Each Preferences put commits to flash. A one-slider change must not write
  // every setting again, especially while the camera is streaming.
  const struct { const char *key; int value; } integers[] = {
      {"framesize", frameSizeToIndex(g_frameSize)}, {"quality", g_jpegQuality},
      {"fps", g_streamFps}, {"bright", g_brightness}, {"contrast", g_contrast},
      {"saturate", g_saturation}, {"sharp", g_sharpness}, {"gainceil", g_gainCeiling},
      {"colorbar", g_colorbar}, {"awb", g_awb}, {"agc", g_agc}, {"aec", g_aec},
      {"awbgain", g_awbGain}, {"agcgain", g_agcGain}, {"aecvalue", g_aecValue},
      {"aec2", g_aec2}, {"dcw", g_dcw}, {"bpc", g_bpc}, {"wpc", g_wpc},
      {"rawgma", g_rawGma}, {"lenc", g_lenc}, {"effect", g_specialEffect},
      {"wbmode", g_wbMode}, {"aelevel", g_aeLevel}, {"hmirror", g_hmirror},
      {"vflip", g_vflip}, {"irmode", g_irMode}};
  bool success = true;
  for (const auto &setting : integers) {
    if ((!g_preferences.isKey(setting.key) ||
         g_preferences.getInt(setting.key) != setting.value) &&
        g_preferences.putInt(setting.key, setting.value) != sizeof(int32_t)) {
      success = false;
    }
    if (g_loopWdtReady) feedLoopWDT();
  }
  const auto saveBool = [&](const char *key, bool value) {
    if ((!g_preferences.isKey(key) || g_preferences.getBool(key) != value) &&
        g_preferences.putBool(key, value) != sizeof(uint8_t)) success = false;
  };
  const auto saveFloat = [&](const char *key, float value) {
    if ((!g_preferences.isKey(key) || g_preferences.getFloat(key) != value) &&
        g_preferences.putFloat(key, value) != sizeof(float)) success = false;
  };
  saveBool("led", g_ledEnabled != 0);
  saveBool("stream", g_streamEnabled);
  saveFloat("ironlux", g_irOnBelowLux);
  saveFloat("irofflux", g_irOffAboveLux);
  if (!success) setError("settings applied but saving to flash failed");
  return success;
}

void loadControllerSettings() {
  const uint8_t configVersion = g_preferences.getUChar("cfgver", 0);
  const bool alignDfrDefaults = configVersion < 2;
  g_frameSize = frameSizeFromIndex(clampValue(g_preferences.getInt("framesize", 6), 0, 7));
  g_jpegQuality = clampValue(g_preferences.getInt("quality", 10), 4, 63);
  g_streamFps = clampValue(g_preferences.getInt("fps", dfrcfg::kDefaultRtspFps), 1, 20);
  g_brightness = clampValue(g_preferences.getInt("bright", 1), -2, 2);
  g_contrast = clampValue(g_preferences.getInt("contrast", 0), -2, 2);
  g_saturation = clampValue(g_preferences.getInt("saturate", -2), -2, 2);
  g_sharpness = clampValue(g_preferences.getInt("sharp", 0), -2, 2);
  g_gainCeiling = clampValue(g_preferences.getInt("gainceil", 0), 0, 6);
  g_colorbar = g_preferences.getInt("colorbar", 0) ? 1 : 0;
  g_awb = g_preferences.getInt("awb", 1) ? 1 : 0;
  g_agc = g_preferences.getInt("agc", 1) ? 1 : 0;
  g_aec = g_preferences.getInt("aec", 1) ? 1 : 0;
  g_awbGain = g_preferences.getInt("awbgain", 1) ? 1 : 0;
  g_agcGain = clampValue(g_preferences.getInt("agcgain", 0), 0, 30);
  g_aecValue = clampValue(g_preferences.getInt("aecvalue", 300), 0, 1200);
  g_aec2 = g_preferences.getInt("aec2", 0) ? 1 : 0;
  g_dcw = g_preferences.getInt("dcw", 1) ? 1 : 0;
  g_bpc = g_preferences.getInt("bpc", 0) ? 1 : 0;
  g_wpc = g_preferences.getInt("wpc", 1) ? 1 : 0;
  g_rawGma = g_preferences.getInt("rawgma", 1) ? 1 : 0;
  g_lenc = g_preferences.getInt("lenc", 1) ? 1 : 0;
  g_specialEffect = clampValue(g_preferences.getInt("effect", 0), 0, 6);
  g_wbMode = clampValue(g_preferences.getInt("wbmode", 0), 0, 4);
  g_aeLevel = clampValue(g_preferences.getInt("aelevel", 0), -2, 2);
  g_hmirror = g_preferences.getInt("hmirror", 0) ? 1 : 0;
  g_vflip = g_preferences.getInt("vflip", 1) ? 1 : 0;
  g_ledEnabled = g_preferences.getBool("led", false) ? 1 : 0;
  g_streamEnabled = g_preferences.getBool("stream", true);
  g_irMode = clampValue(g_preferences.getInt("irmode", 2), 0, 2);
  g_irOnBelowLux = g_preferences.getFloat("ironlux", dfrcfg::kDefaultIrOnBelowLux);
  g_irOffAboveLux = g_preferences.getFloat("irofflux", dfrcfg::kDefaultIrOffAboveLux);
  if (!isfinite(g_irOnBelowLux) || g_irOnBelowLux < 0 || g_irOnBelowLux > 100000)
    g_irOnBelowLux = dfrcfg::kDefaultIrOnBelowLux;
  if (!isfinite(g_irOffAboveLux) || g_irOffAboveLux < 1 || g_irOffAboveLux > 100002)
    g_irOffAboveLux = dfrcfg::kDefaultIrOffAboveLux;
  if (g_irOffAboveLux <= g_irOnBelowLux) g_irOffAboveLux = g_irOnBelowLux + 2.0f;

  // Match DFRobot's CameraWebServer defaults once; later user changes remain persistent.
  if (alignDfrDefaults) {
    g_frameSize = FRAMESIZE_UXGA;
    g_jpegQuality = 10;
    g_brightness = 1;
    g_contrast = 0;
    g_saturation = -2;
    g_sharpness = 0;
    g_vflip = 1;
  }
  if (configVersion < 3) {
    if (saveControllerSettings()) g_preferences.putUChar("cfgver", 3);
  }
}

bool applySensorSettings(bool rebuildAfter) {
  sensor_t *sensor = esp_camera_sensor_get();
  if (sensor == nullptr) {
    setError("camera sensor unavailable");
    return false;
  }
  bool success = true;
  String failedSetting;
  const auto check = [&](int result, const char *name) {
    if (result == 0) return;
    success = false;
    if (failedSetting.length() == 0) failedSetting = name;
  };

  check(sensor->set_framesize(sensor, g_frameSize), "framesize");
  check(sensor->set_quality(sensor, g_jpegQuality), "jpeg_quality");
  check(sensor->set_brightness(sensor, g_brightness), "brightness");
  check(sensor->set_contrast(sensor, g_contrast), "contrast");
  check(sensor->set_saturation(sensor, g_saturation), "saturation");
  check(sensor->set_sharpness(sensor, g_sharpness), "sharpness");
  check(sensor->set_gainceiling(sensor, static_cast<gainceiling_t>(g_gainCeiling)), "gainceiling");
  check(sensor->set_colorbar(sensor, g_colorbar), "colorbar");
  check(sensor->set_whitebal(sensor, g_awb), "awb");
  check(sensor->set_gain_ctrl(sensor, g_agc), "agc");
  check(sensor->set_exposure_ctrl(sensor, g_aec), "aec");
  check(sensor->set_awb_gain(sensor, g_awbGain), "awb_gain");
  check(sensor->set_agc_gain(sensor, g_agcGain), "agc_gain");
  check(sensor->set_aec_value(sensor, g_aecValue), "aec_value");
  check(sensor->set_aec2(sensor, g_aec2), "aec2");
  check(sensor->set_dcw(sensor, g_dcw), "dcw");
  check(sensor->set_bpc(sensor, g_bpc), "bpc");
  check(sensor->set_wpc(sensor, g_wpc), "wpc");
  check(sensor->set_raw_gma(sensor, g_rawGma), "raw_gma");
  check(sensor->set_lenc(sensor, g_lenc), "lenc");
  check(sensor->set_special_effect(sensor, g_specialEffect), "special_effect");
  check(sensor->set_wb_mode(sensor, g_wbMode), "wb_mode");
  check(sensor->set_ae_level(sensor, g_aeLevel), "ae_level");
  check(sensor->set_hmirror(sensor, g_hmirror), "hmirror");
  check(sensor->set_vflip(sensor, g_vflip), "vflip");
  applyLedState(g_ledEnabled != 0);
  evaluateIrAutomation();
  if (rebuildAfter) rebuildStreamer();
  if (!success) {
    setError("camera setting apply failed: " + failedSetting);
    return false;
  }
  clearError();
  return true;
}

