Wittiii/Esp32cam/src/dfr1154_cam_controller.cpp
void ensureWifi() {
  if (WiFi.status() == WL_CONNECTED) return;
  const uint32_t now = millis();
  const uint32_t retryDelay = boundedReconnectDelay(
      g_wifiAttemptCount, dfrcfg::kWifiRetryInitialMs, dfrcfg::kWifiRetryMaxMs);
  if (g_lastWifiAttemptMs != 0 && now - g_lastWifiAttemptMs < retryDelay) return;
  g_lastWifiAttemptMs = now;
  ++g_wifiAttemptCount;

  if (!g_wifiStarted) {
    g_wifiStarted = true;
    statusf("wifi connecting ssid=%s", dfrcfg::kWifiSsid);
    WiFi.begin(dfrcfg::kWifiSsid, dfrcfg::kWifiPassword);
  } else if (g_wifiAttemptCount % dfrcfg::kWifiHardReconnectEvery == 0) {
    recordStatus("wifi stack reconnect");
    WiFi.mode(WIFI_STA);
    WiFi.disconnect(false, false);
    delay(20);
    WiFi.begin(dfrcfg::kWifiSsid, dfrcfg::kWifiPassword);
  } else {
    WiFi.reconnect();
  }
}

bool extractPayloadToken(const String &payload, const String &key, String &token) {
  return camcommon::extractPayloadToken(payload, key.c_str(), token);
}

bool extractPayloadInt(const String &payload, const char *key, int &value) {
  return camcommon::extractPayloadInt(payload, key, value);
}

enum class SettingResult { unsupported, unchanged, applied, failed };

template <typename Value>
bool applySensorControl(
    sensor_t *sensor,
    int (*setter)(sensor_t *, Value),
    Value value,
    const char *key) {
  for (int attempt = 0; attempt < 3; ++attempt) {
    if (setter(sensor, value) == 0) {
      // Several OV3660 controls share register 0x5000. Give SCCB time before
      // applying the next item from an MQTT settings batch.
      delay(10);
      return true;
    }
    feedLoopWDT();
    delay(25 * (attempt + 1));
  }
  statusf("sensor setting rejected key=%s value=%d", key, static_cast<int>(value));
  return false;
}

SettingResult applySetting(const char *key, int value, bool &streamRebuildRequired) {
  sensor_t *sensor = esp_camera_sensor_get();
  const auto requireSensor = [&]() {
    if (sensor != nullptr) return true;
    requestCameraRecovery("sensor unavailable while applying settings");
    return false;
  };

  if (strcmp(key, "framesize") == 0) {
    const framesize_t bounded = frameSizeFromIndex(clampValue(value, 0, 7));
    if (bounded == g_frameSize) return SettingResult::unchanged;
    if (!requireSensor() || !applySensorControl(sensor, sensor->set_framesize, bounded, key)) return SettingResult::failed;
    g_frameSize = bounded;
    streamRebuildRequired = true;
  } else if (strcmp(key, "jpeg_quality") == 0) {
    const int bounded = clampValue(value, 4, 63);
    if (bounded == g_jpegQuality) return SettingResult::unchanged;
    if (!requireSensor() || !applySensorControl(sensor, sensor->set_quality, bounded, key)) return SettingResult::failed;
    g_jpegQuality = bounded;
  } else if (strcmp(key, "stream_fps") == 0) {
    const int bounded = clampValue(value, 1, 20);
    if (bounded == g_streamFps) return SettingResult::unchanged;
    g_streamFps = bounded;
  } else if (strcmp(key, "brightness") == 0) {
    const int bounded = clampValue(value, -2, 2);
    if (bounded == g_brightness) return SettingResult::unchanged;
    if (!requireSensor() || !applySensorControl(sensor, sensor->set_brightness, bounded, key)) return SettingResult::failed;
    g_brightness = bounded;
  } else if (strcmp(key, "contrast") == 0) {
    const int bounded = clampValue(value, -2, 2);
    if (bounded == g_contrast) return SettingResult::unchanged;
    if (!requireSensor() || !applySensorControl(sensor, sensor->set_contrast, bounded, key)) return SettingResult::failed;
    g_contrast = bounded;
  } else if (strcmp(key, "saturation") == 0) {
    const int bounded = clampValue(value, -2, 2);
    if (bounded == g_saturation) return SettingResult::unchanged;
    if (!requireSensor() || !applySensorControl(sensor, sensor->set_saturation, bounded, key)) return SettingResult::failed;
    g_saturation = bounded;
  } else if (strcmp(key, "sharpness") == 0) {
    const int bounded = clampValue(value, -2, 2);
    if (bounded == g_sharpness) return SettingResult::unchanged;
    if (!requireSensor() || !applySensorControl(sensor, sensor->set_sharpness, bounded, key)) return SettingResult::failed;
    g_sharpness = bounded;
  } else if (strcmp(key, "gainceiling") == 0) {
    const int bounded = clampValue(value, 0, 6);
    if (bounded == g_gainCeiling) return SettingResult::unchanged;
    const auto gain = static_cast<gainceiling_t>(bounded);
    if (!requireSensor() || !applySensorControl(sensor, sensor->set_gainceiling, gain, key)) return SettingResult::failed;
    g_gainCeiling = bounded;
  } else if (strcmp(key, "colorbar") == 0) {
    const int bounded = value ? 1 : 0;
    if (bounded == g_colorbar) return SettingResult::unchanged;
    if (!requireSensor() || !applySensorControl(sensor, sensor->set_colorbar, bounded, key)) return SettingResult::failed;
    g_colorbar = bounded;
  } else if (strcmp(key, "awb") == 0) {
    const int bounded = value ? 1 : 0;
    if (bounded == g_awb) return SettingResult::unchanged;
    if (!requireSensor() || !applySensorControl(sensor, sensor->set_whitebal, bounded, key)) return SettingResult::failed;
    g_awb = bounded;
  } else if (strcmp(key, "agc") == 0) {
    const int bounded = value ? 1 : 0;
    if (bounded == g_agc) return SettingResult::unchanged;
    if (!requireSensor() || !applySensorControl(sensor, sensor->set_gain_ctrl, bounded, key)) return SettingResult::failed;
    g_agc = bounded;
  } else if (strcmp(key, "aec") == 0) {
    const int bounded = value ? 1 : 0;
    if (bounded == g_aec) return SettingResult::unchanged;
    if (!requireSensor() || !applySensorControl(sensor, sensor->set_exposure_ctrl, bounded, key)) return SettingResult::failed;
    g_aec = bounded;
  } else if (strcmp(key, "awb_gain") == 0) {
    const int bounded = value ? 1 : 0;
    if (bounded == g_awbGain) return SettingResult::unchanged;
    if (!requireSensor() || !applySensorControl(sensor, sensor->set_awb_gain, bounded, key)) return SettingResult::failed;
    g_awbGain = bounded;
  } else if (strcmp(key, "agc_gain") == 0) {
    const int bounded = clampValue(value, 0, 30);
    if (bounded == g_agcGain) return SettingResult::unchanged;
    if (!requireSensor() || !applySensorControl(sensor, sensor->set_agc_gain, bounded, key)) return SettingResult::failed;
    g_agcGain = bounded;
  } else if (strcmp(key, "aec_value") == 0) {
    const int bounded = clampValue(value, 0, 1200);
    if (bounded == g_aecValue) return SettingResult::unchanged;
    if (!requireSensor() || !applySensorControl(sensor, sensor->set_aec_value, bounded, key)) return SettingResult::failed;
    g_aecValue = bounded;
  } else if (strcmp(key, "aec2") == 0) {
    const int bounded = value ? 1 : 0;
    if (bounded == g_aec2) return SettingResult::unchanged;
    if (!requireSensor() || !applySensorControl(sensor, sensor->set_aec2, bounded, key)) return SettingResult::failed;
    g_aec2 = bounded;
  } else if (strcmp(key, "dcw") == 0) {
    const int bounded = value ? 1 : 0;
    if (bounded == g_dcw) return SettingResult::unchanged;
    if (!requireSensor() || !applySensorControl(sensor, sensor->set_dcw, bounded, key)) return SettingResult::failed;
    g_dcw = bounded;
  } else if (strcmp(key, "bpc") == 0) {
    const int bounded = value ? 1 : 0;
    if (bounded == g_bpc) return SettingResult::unchanged;
    if (!requireSensor() || !applySensorControl(sensor, sensor->set_bpc, bounded, key)) return SettingResult::failed;
    g_bpc = bounded;
  } else if (strcmp(key, "wpc") == 0) {
    const int bounded = value ? 1 : 0;
    if (bounded == g_wpc) return SettingResult::unchanged;
    if (!requireSensor() || !applySensorControl(sensor, sensor->set_wpc, bounded, key)) return SettingResult::failed;
    g_wpc = bounded;
  } else if (strcmp(key, "raw_gma") == 0) {
    const int bounded = value ? 1 : 0;
    if (bounded == g_rawGma) return SettingResult::unchanged;
    if (!requireSensor() || !applySensorControl(sensor, sensor->set_raw_gma, bounded, key)) return SettingResult::failed;
    g_rawGma = bounded;
  } else if (strcmp(key, "lenc") == 0) {
    const int bounded = value ? 1 : 0;
    if (bounded == g_lenc) return SettingResult::unchanged;
    if (!requireSensor() || !applySensorControl(sensor, sensor->set_lenc, bounded, key)) return SettingResult::failed;
    g_lenc = bounded;
  } else if (strcmp(key, "special_effect") == 0) {
    const int bounded = clampValue(value, 0, 6);
    if (bounded == g_specialEffect) return SettingResult::unchanged;
    if (!requireSensor() || !applySensorControl(sensor, sensor->set_special_effect, bounded, key)) return SettingResult::failed;
    g_specialEffect = bounded;
  } else if (strcmp(key, "wb_mode") == 0) {
    const int bounded = clampValue(value, 0, 4);
    if (bounded == g_wbMode) return SettingResult::unchanged;
    if (!requireSensor() || !applySensorControl(sensor, sensor->set_wb_mode, bounded, key)) return SettingResult::failed;
    g_wbMode = bounded;
  } else if (strcmp(key, "ae_level") == 0) {
    const int bounded = clampValue(value, -2, 2);
    if (bounded == g_aeLevel) return SettingResult::unchanged;
    if (!requireSensor() || !applySensorControl(sensor, sensor->set_ae_level, bounded, key)) return SettingResult::failed;
    g_aeLevel = bounded;
  } else if (strcmp(key, "hmirror") == 0) {
    const int bounded = value ? 1 : 0;
    if (bounded == g_hmirror) return SettingResult::unchanged;
    if (!requireSensor() || !applySensorControl(sensor, sensor->set_hmirror, bounded, key)) return SettingResult::failed;
    g_hmirror = bounded;
  } else if (strcmp(key, "vflip") == 0) {
    const int bounded = value ? 1 : 0;
    if (bounded == g_vflip) return SettingResult::unchanged;
    if (!requireSensor() || !applySensorControl(sensor, sensor->set_vflip, bounded, key)) return SettingResult::failed;
    g_vflip = bounded;
  } else if (strcmp(key, "led") == 0) {
    const int bounded = value ? 1 : 0;
    if (bounded == g_ledEnabled) return SettingResult::unchanged;
    applyLedState(bounded != 0);
  } else if (strcmp(key, "stream_enabled") == 0) {
    const bool enabled = value != 0;
    if (enabled == g_streamEnabled) return SettingResult::unchanged;
    g_streamEnabled = enabled;
    streamRebuildRequired = true;
  } else if (strcmp(key, "ir_mode") == 0) {
    const int bounded = clampValue(value, 0, 2);
    if (bounded == g_irMode) return SettingResult::unchanged;
    g_irMode = bounded;
    evaluateIrAutomation();
  } else if (strcmp(key, "ir_on_lux") == 0) {
    const float bounded = static_cast<float>(clampValue(value, 0, 100000));
    if (fabsf(bounded - g_irOnBelowLux) < 0.01f) return SettingResult::unchanged;
    g_irOnBelowLux = bounded;
    if (g_irOffAboveLux <= g_irOnBelowLux) g_irOffAboveLux = g_irOnBelowLux + 2.0f;
    evaluateIrAutomation();
  } else if (strcmp(key, "ir_off_lux") == 0) {
    const float bounded = static_cast<float>(clampValue(value, 1, 100000));
    if (fabsf(bounded - g_irOffAboveLux) < 0.01f) return SettingResult::unchanged;
    g_irOffAboveLux = bounded;
    if (g_irOffAboveLux <= g_irOnBelowLux) g_irOnBelowLux = max(0.0f, g_irOffAboveLux - 2.0f);
    evaluateIrAutomation();
  } else if (strcmp(key, "timelapse_enabled") == 0 || strcmp(key, "server_capture_enabled") == 0) {
    const bool enabled = value != 0;
    if (enabled == dfrcapture::enabled()) return SettingResult::unchanged;
    if (!dfrcapture::setEnabled(enabled)) return SettingResult::failed;
  } else if (strcmp(key, "timelapse_interval_seconds") == 0 || strcmp(key, "server_capture_interval_seconds") == 0) {
    const uint32_t bounded = static_cast<uint32_t>(clampValue(value, 5, 86400));
    if (bounded == dfrcapture::intervalSeconds()) return SettingResult::unchanged;
    if (!dfrcapture::setIntervalSeconds(bounded)) return SettingResult::failed;
  } else {
    return SettingResult::unsupported;
  }
  return SettingResult::applied;
}

void applyControlPayload(const String &payload) {
  static const char *keys[] = {
      "framesize", "jpeg_quality", "stream_fps", "brightness", "contrast", "saturation",
      "sharpness", "gainceiling", "colorbar", "awb", "agc", "aec", "awb_gain",
      "agc_gain", "aec_value", "aec2", "dcw", "bpc", "wpc", "raw_gma", "lenc",
      "special_effect", "wb_mode", "ae_level", "hmirror", "vflip", "led",
      "stream_enabled", "ir_mode", "ir_on_lux", "ir_off_lux", "server_capture_enabled",
      "server_capture_interval_seconds", "timelapse_enabled", "timelapse_interval_seconds"};

  String requestId;
  extractPayloadToken(payload, "_request_id", requestId);
  bool recognized = false;
  bool changed = false;
  bool failed = false;
  bool streamRebuildRequired = false;
  String failedSettings;
  for (const char *key : keys) {
    int value = 0;
    if (!extractPayloadInt(payload, key, value)) continue;
    const SettingResult result = applySetting(key, value, streamRebuildRequired);
    if (result != SettingResult::unsupported) recognized = true;
    if (result == SettingResult::applied) changed = true;
    if (result == SettingResult::failed) {
      failed = true;
      if (failedSettings.length() > 0) failedSettings += ",";
      failedSettings += key;
    }
  }

  if (!recognized) {
    setCommandResult("set", requestId, "error", "no supported setting in payload");
    setError("no supported setting in MQTT payload");
    publishStatus(true);
    return;
  }

  if (changed && !saveControllerSettings()) {
    failed = true;
    if (failedSettings.length() > 0) failedSettings += ",";
    failedSettings += "persistence";
  }
  if (streamRebuildRequired) rebuildStreamer();
  if (failed) {
    const String message = "setting apply failed: " + failedSettings;
    setCommandResult("set", requestId, changed ? "partial" : "error", message);
    setError(message);
  } else {
    clearError();
    setCommandResult("set", requestId, "ok", changed ? "settings applied" : "settings already active");
    statusf("camera control applied live frame=%s q=%d fps=%d", frameSizeName(), g_jpegQuality, g_streamFps);
  }
  publishStatus(true);
}

void applyTimelapsePayload(const String &payload) {
  String requestId;
  extractPayloadToken(payload, "_request_id", requestId);
  int value = 0;
  bool changed = false;
  bool success = true;
  if (extractPayloadInt(payload, "enabled", value)) {
    success = dfrcapture::setEnabled(value != 0) && success;
    changed = true;
  }
  if (extractPayloadInt(payload, "interval_seconds", value)) {
    success = dfrcapture::setIntervalSeconds(static_cast<uint32_t>(max(5, value))) && success;
    changed = true;
  }
  if (!changed) {
    setCommandResult("capture_set", requestId, "error", "no supported capture setting in payload");
    setError("no supported server capture setting in MQTT payload");
  } else if (!success) {
    setCommandResult("capture_set", requestId, "error", "saving capture settings failed");
    setError("saving server capture settings failed");
  } else {
    clearError();
    setCommandResult("capture_set", requestId, "ok", "server capture settings applied");
  }
  publishStatus(true);
}

void processMqttMessage(const String &topicText, const String &payloadText) {
  String requestId;
  extractPayloadToken(payloadText, "_request_id", requestId);

