Wittiii/Esp32cam/src/dfr1154_cam_controller.cpp
  if (topicText == mqttTopic("cmd/start")) {
    const bool wasEnabled = g_streamEnabled;
    g_streamEnabled = true;
    const bool saved = saveControllerSettings();
    if (!wasEnabled || g_streamer == nullptr) rebuildStreamer();
    if (saved) clearError();
    setCommandResult("start", requestId, saved ? "ok" : "partial",
                     saved ? "stream enabled" : "stream enabled; saving settings failed");
    recordStatus("mqtt start command");
  } else if (topicText == mqttTopic("cmd/stop")) {
    g_streamEnabled = false;
    const bool saved = saveControllerSettings();
    g_streamer.reset();
    setCommandResult("stop", requestId, saved ? "ok" : "partial",
                     saved ? "stream disabled" : "stream disabled; saving settings failed");
    recordStatus("mqtt stop command");
  } else if (topicText == mqttTopic("cmd/restart")) {
    setCommandResult("restart", requestId, "ok", "device rebooting");
    publishSimple("status/state", "restarting");
    publishStatus(true);
    flushStatus();
    g_mqttClient.loop();
    delay(100);
    ESP.restart();
  } else if (topicText == mqttTopic("cmd/ping")) {
    publishSimple("status/pong", requestId.length() > 0 ? requestId : (payloadText.length() > 0 ? payloadText : "pong"));
    setCommandResult("ping", requestId, "ok", "pong");
  } else if (topicText == mqttTopic("cmd/set")) {
    applyControlPayload(payloadText);
  } else if (topicText == mqttTopic("cmd/timelapse/start")) {
    if (!dfrcapture::setEnabled(true)) {
      setError("unable to start server capture");
      setCommandResult("capture_start", requestId, "error", g_lastError);
    } else {
      setCommandResult("capture_start", requestId, "ok", "server capture requested");
    }
  } else if (topicText == mqttTopic("cmd/timelapse/stop")) {
    const bool saved = dfrcapture::setEnabled(false);
    setCommandResult("capture_stop", requestId, saved ? "ok" : "error",
                     saved ? "server capture disabled" : "saving capture settings failed");
  } else if (topicText == mqttTopic("cmd/timelapse/set")) {
    applyTimelapsePayload(payloadText);
  }
  publishStatus(true);
}

void mqttCallback(char *topic, byte *payload, unsigned int length) {
  if (length > 1536 || strlen(topic) > 192 ||
      g_pendingMqttCount == g_pendingMqttMessages.size()) {
    ++g_mqttCommandDrops;
    return;
  }
  PendingMqttMessage &message = g_pendingMqttMessages[
      (g_pendingMqttHead + g_pendingMqttCount) % g_pendingMqttMessages.size()];
  message.topic = topic;
  message.payload = "";
  if (message.topic.length() != strlen(topic) ||
      !message.payload.concat(reinterpret_cast<const char *>(payload), length)) {
    ++g_mqttCommandDrops;
    return;
  }
  ++g_pendingMqttCount;
}

void handlePendingMqttMessage() {
  if (g_pendingMqttCount == 0) return;
  PendingMqttMessage message = std::move(g_pendingMqttMessages[g_pendingMqttHead]);
  g_pendingMqttHead = (g_pendingMqttHead + 1) % g_pendingMqttMessages.size();
  --g_pendingMqttCount;
  Serial.printf("[MQTT] %s (%u bytes)\n", message.topic.c_str(), message.payload.length());
  processMqttMessage(message.topic, message.payload);
}

void ensureMqtt() {
  if (WiFi.status() != WL_CONNECTED) {
    if (g_mqttClient.connected()) g_mqttClient.disconnect();
    g_mqttSocket.stop();
    g_mqttAttemptCount = 0;
    g_lastMqttAttemptMs = 0;
    return;
  }
  g_mqttClient.loop();
  if (g_mqttClient.connected()) {
    g_mqttAttemptCount = 0;
    return;
  }

  const uint32_t now = millis();
  const uint32_t retryDelay = boundedReconnectDelay(
      g_mqttAttemptCount, dfrcfg::kMqttRetryInitialMs, dfrcfg::kMqttRetryMaxMs);
  if (g_lastMqttAttemptMs != 0 && now - g_lastMqttAttemptMs < retryDelay) return;
  g_lastMqttAttemptMs = now;
  ++g_mqttAttemptCount;

  g_mqttClient.disconnect();
  g_mqttSocket.stop();
  // PubSubClient's timeout only covers MQTT packets. WiFiClient uses seconds
  // here and applies this limit to the TCP connection as well.
  g_mqttSocket.setTimeout(1);

  const String willTopic = mqttTopic("status/online");
  bool connected = false;
  if (strlen(dfrcfg::kMqttUsername) > 0) {
    connected = g_mqttClient.connect(
        dfrcfg::kMqttClientId,
        dfrcfg::kMqttUsername,
        dfrcfg::kMqttPassword,
        willTopic.c_str(),
        1,
        true,
        "false");
  } else {
    connected = g_mqttClient.connect(dfrcfg::kMqttClientId, willTopic.c_str(), 1, true, "false");
  }
  if (!connected) {
    g_mqttSocket.stop();
    statusf("mqtt connect failed rc=%d", g_mqttClient.state());
    return;
  }

  g_mqttAttemptCount = 0;
  if (g_mqttEverConnected) ++g_mqttReconnectCount;
  g_mqttEverConnected = true;
  g_mqttSocket.setNoDelay(true);

  g_mqttClient.subscribe(mqttTopic("cmd/start").c_str(), 1);
  g_mqttClient.subscribe(mqttTopic("cmd/stop").c_str(), 1);
  g_mqttClient.subscribe(mqttTopic("cmd/restart").c_str(), 1);
  g_mqttClient.subscribe(mqttTopic("cmd/ping").c_str(), 1);
  g_mqttClient.subscribe(mqttTopic("cmd/set").c_str(), 1);
  g_mqttClient.subscribe(mqttTopic("cmd/timelapse/start").c_str(), 1);
  g_mqttClient.subscribe(mqttTopic("cmd/timelapse/stop").c_str(), 1);
  g_mqttClient.subscribe(mqttTopic("cmd/timelapse/set").c_str(), 1);
  statusf("mqtt connected topic=%s", dfrcfg::kMqttBaseTopic);
  publishStatus(true);
}

void handleRtspLoop() {
  if (WiFi.status() != WL_CONNECTED || !g_cameraReady) return;
  if (!g_streamEnabled) {
    WiFiClient waitingClient = g_rtspServer.accept();
    if (waitingClient) waitingClient.stop();
    return;
  }
  if (g_streamer == nullptr) rebuildStreamer();
  if (g_streamer == nullptr) return;

  g_streamer->handleRequests(0);
  const uint32_t now = millis();
  const uint32_t frameIntervalMs = 1000UL / static_cast<uint32_t>(max(1, g_streamFps));
  if (g_streamer->anySessions() &&
      (now - g_lastFrameAtMs >= frameIntervalMs || now < g_lastFrameAtMs)) {
    g_streamer->streamImage(now);
    g_lastFrameAtMs = now;
    if (g_streamer->lastFrameSucceeded()) {
      ++g_framesSent;
    } else if (g_streamer->consecutiveCaptureFailures() >= 5) {
      requestCameraRecovery("repeated frame capture failures");
    }
  }

  WiFiClient client = g_rtspServer.accept();
  if (client) {
    client.setNoDelay(true);
    const String remote = client.remoteIP().toString();
    g_streamer->addSession(new WiFiClient(client));
    statusf("rtsp client=%s", remote.c_str());
  }
}

void updateRuntimeStats() {
  const uint32_t now = millis();
  if (now - g_lastStatsMs < dfrcfg::kStatusIntervalMs) return;
  const float seconds = g_lastStatsMs == 0 ? 5.0f : (now - g_lastStatsMs) / 1000.0f;
  g_lastMeasuredFps = g_framesSent / seconds;
  g_framesSent = 0;
  g_lastStatsMs = now;
  statusf(
      "runtime wifi=%s mqtt=%s rtsp=%s sessions=%d fps=%.1f lux=%.2f ir=%s timelapse=%s",
      WiFi.status() == WL_CONNECTED ? "up" : "down",
      g_mqttClient.connected() ? "up" : "down",
      g_streamEnabled ? "on" : "off",
      directStreamingSessionCount(),
      g_lastMeasuredFps,
      g_ambientLux,
      g_irEnabled ? "on" : "off",
      dfrcapture::state().c_str());
  publishStatus();
}

void ensureVictron() {
  if (g_victronBeginAttempted || !dfrcfg::kVictronEnabled) return;
  if (millis() < dfrcfg::kVictronStartDelayMs) return;
  if (WiFi.status() != WL_CONNECTED || !g_mqttClient.connected()) return;

  g_victronBeginAttempted = true;
  recordStatus("victron BLE initializing");
  dfrvictron::begin();
}

}  // namespace

namespace dfr1154 {

void setupController() {
  Serial.begin(115200);
  delay(500);
  g_bootResetReason = esp_reset_reason();
  Serial.println("\n[BOOT] DFR1154 camera controller starting");

  pinMode(DFR_LED_PIN, OUTPUT);
  pinMode(DFR_IR_PIN, OUTPUT);
  digitalWrite(DFR_LED_PIN, LOW);
  digitalWrite(DFR_IR_PIN, LOW);

  Wire.begin(DFR_CAM_SIOD, DFR_CAM_SIOC, 100000);

  g_preferencesReady = g_preferences.begin("dfrcam", false);
  loadControllerSettings();
  initCamera();
  configureLightSensor();
  dfrbme::begin();
  dfrcapture::begin();

  statusf(
      "flash=%luMB psram=%luMB heap=%luKB",
      ESP.getFlashChipSize() / (1024UL * 1024UL),
      ESP.getPsramSize() / (1024UL * 1024UL),
      ESP.getFreeHeap() / 1024UL);

  WiFi.mode(WIFI_STA);
  WiFi.persistent(false);
  WiFi.setSleep(false);
  WiFi.setAutoReconnect(true);
  WiFi.onEvent(onWifiEvent);
  g_mqttClient.setServer(dfrcfg::kMqttHost, dfrcfg::kMqttPort);
  g_mqttClient.setCallback(mqttCallback);
  g_mqttClient.setSocketTimeout(1);
  g_mqttClient.setKeepAlive(20);
  if (!g_mqttClient.setBufferSize(2048)) setError("MQTT buffer allocation failed");
  enableLoopWDT();
  g_loopWdtReady = true;
  ensureWifi();
}

void loopController() {
  if (g_otaReady) ArduinoOTA.handle();
  dfrbme::loop();
  handleWifiEvents();
  ensureWifi();
  handleNetworkServices();
  if (g_otaActive) {
    delay(1);
    return;
  }
  dfrvictron::loop();
  ensureMqtt();
  ensureVictron();
  handlePendingMqttMessage();
  if (g_otaReady) ArduinoOTA.handle();
  handleCameraRecovery();
  handleLightSensor();
  handleRtspLoop();
  updateRuntimeStats();
  flushStatus();
  delay(1);
}

}  // namespace dfr1154
